Tan-Hung5/STM32_Basic/GPIO_INPUT_INTERRUPT/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define led_1_Pin GPIO_PIN_1
#define led_1_GPIO_Port GPIOA
#define led_2_Pin GPIO_PIN_2
#define led_2_GPIO_Port GPIOA
#define led_3_Pin GPIO_PIN_3
#define led_3_GPIO_Port GPIOA
#define led_4_Pin GPIO_PIN_4
#define led_4_GPIO_Port GPIOA
#define led_5_Pin GPIO_PIN_5
#define led_5_GPIO_Port GPIOA
#define led_6_Pin GPIO_PIN_6
#define led_6_GPIO_Port GPIOA
#define led_7_Pin GPIO_PIN_7
#define led_7_GPIO_Port GPIOA
#define led_8_Pin GPIO_PIN_0
#define led_8_GPIO_Port GPIOB
#define key_1_Pin GPIO_PIN_12
#define key_1_GPIO_Port GPIOB
#define key_1_EXTI_IRQn EXTI15_10_IRQn
#define key_2_Pin GPIO_PIN_13
#define key_2_GPIO_Port GPIOB
#define key_2_EXTI_IRQn EXTI15_10_IRQn

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
